Управление_по_целям_и_KPI/src/Reports/KPI_ПланФакты/KPI_ПланФакты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>KPI_ПланФакты</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектУправления</name>
    <type>
      <types>CatalogRef.KPI_СтруктураКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьПланирования</name>
    <type>
      <types>EnumRef.KPI_ПериодичностьПланирования</types>
    </type>
  </attributes>
</mdclass:Report>

Управление_по_целям_и_KPI/src/Reports/KPI_ПланФакты/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
		
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	Расшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	ОтчетОбъект.СкомпоноватьРезультат(Результат, Расшифровки) ;
	ЗначениеВРеквизитФормы(ОтчетОбъект,"Отчет");
	
	ОтображениеСостояния = Элементы.Результат.ОтображениеСостояния;
	ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
	ОтображениеСостояния.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
		
	ОтчетНеСформирован();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектУправленияПриИзменении(Элемент)
		
	ОтчетНеСформирован();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПланированияПриИзменении(Элемент)
	
	ОтчетНеСформирован();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетНеСформирован()
	
	ОтображениеСостояния = Элементы.Результат.ОтображениеСостояния;
	ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
	ОтображениеСостояния.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектУправленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Отчет.Период) Тогда
		Сообщить("Не заполнен период");
		Возврат;
	КонецЕсли;
	
	ОбъектУправления = KPI_ОбщегоНазначения.ОбработкаВыбораПолучитьСтруктуруКомпанииНаДату(Отчет.Период, ЭтаФорма, СтандартнаяОбработка, , Отчет.ОбъектУправления);
	
	Если Не ОбъектУправления = Неопределено Тогда
		Отчет.ОбъектУправления           = ОбъектУправления.СтруктураКомпании;
		ПредставлениеОбъектаУправления   = ОбъектУправления.СтруктураКомпанииПредставление;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	Если ЗначениеЗаполнено(Отчет.Период) И ЗначениеЗаполнено(Отчет.ОбъектУправления) Тогда
		ПредставлениеОбъектаУправления = KPI_ОбщегоНазначенияСервер.ПолучитьПредставлениеПоСтруктуреКомпанииНаДату(Отчет.ОбъектУправления,Отчет.Период);
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Параметры.Свойство("ПериодичностьПланирования") Тогда
		Отчет.ПериодичностьПланирования = Параметры.ПериодичностьПланирования;
	КонецЕсли;
	
	Если Параметры.Свойство("Дата") Тогда
		Отчет.Период = Параметры.Дата;
	КонецЕсли;
	
	Если Параметры.Свойство("Период") Тогда
		Отчет.Период = Параметры.Период;
	КонецЕсли;

	
	Если Параметры.Свойство("ОбъектУправления") Тогда
		Отчет.ОбъектУправления = Параметры.ОбъектУправления;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отчет.ОбъектУправления) Тогда
		ЭтаФорма.ПредставлениеОбъектаУправления = KPI_ОбщегоНазначенияСервер.ПолучитьПредставлениеПоСтруктуреКомпанииНаДату(Отчет.ОбъектУправления,Отчет.Период);
	КонецЕсли;
	
	ЭтаФорма.Заголовок = "План-факты";
	
	Если Параметры.Свойство("РежимРасшифровки") Тогда
		СформироватьНаСервере();
	КонецЕсли;

	
КонецПроцедуры
